
# coding: utf-8

# ---
# # 課題1 - Python基礎文法

# ---
# 課題1: 48 + 29の計算をせよ（計算結果は「ans」に格納すること）

# In[ ]:


# 以下よりコードを記入してください  ##############################


# 出力  #################################################
print(ans)


# ---
# 課題2: 63を11で割った余りを求めよ（計算結果は「ans」に格納すること）

# In[ ]:


# 以下よりコードを記入してください  ##############################


# 出力  #################################################
print(ans)


# ---
# 課題3: 与えられたリスト「l」に対して、要素ごとの文字数が偶数のものと奇数のものを分けるプログラムを作成せよ
# 
# 偶数のものは「even」、奇数のものは「odd」に格納すること

# In[ ]:


l = ['you', 'are', 'so', 'cool', 'data', 'scientist']
even = [] # 偶数
odd = []  # 奇数

# 以下よりコードを記入してください  ##############################


# 出力  #################################################
print('Even: ', even)
print('Odd: ', odd)


# ---
# 課題4: FuzzBuzz問題
# 
# 1~50の数値で、4で割り切れる場合は「Fuzz」、9で割り切れる場合は「Buzz」、両者で割り切れる場合は「FuzzBuzz」に変換し、リスト「ans_list」に格納せよ
# 
# なお、上記条件に当てはまらないものは元の数値のまま格納すること

# In[ ]:


ans_list = []

# 以下よりコードを記入してください  ##############################

        
# 出力  #################################################
print(ans_list)


# ---
# 課題5: 素数判定プログラムを作成し、5桁の素数で最も大きいものを出力せよ（回答結果は「ans」に格納すること）

# In[ ]:


# 以下よりコードを記入してください  ##############################


# 出力  #################################################
print(ans)


# ---
# 課題6: [フィボナッチ数列](https://ja.wikipedia.org/wiki/%E3%83%95%E3%82%A3%E3%83%9C%E3%83%8A%E3%83%83%E3%83%81%E6%95%B0)
# 
# 1~100,000までの整数の範囲のフィボナッチ数列を表示せよ
# 
# 数列はリスト型で作成し、変数名は「Fibonacci」とすること

# In[ ]:


Fibonacci = [0, 1]
# 以下よりコードを記入してください  ##############################


# 出力  #################################################
print(Fibonacci)


# ---
# 課題7: [完全数](https://ja.wikipedia.org/wiki/%E5%AE%8C%E5%85%A8%E6%95%B0)を見つけてみよう
# 
# 完全数を判定するプログラムを作成せよ。そのプログラムを元に1 ~ 10,000以下の範囲にある完全数を出力せよ。
# 
# ※完全数とは、自分自身を除く正の約数の和に等しくなる自然数のことである。
# 
# 例： 「6」： 素因数分解すると、6 = 1 * 2 * 3となる。この素因数をすべて足すと、元の「6」と等しくなる
# 
# 回答はリスト型で作成し、変数名は「PerfectNumbers」とすること

# In[ ]:


PerfectNumbers = []
# 以下よりコードを記入してください  ##############################

        
# 出力  #################################################
print(PerfectNumbers)


# ---
# 課題８: オリジナルのプログラムを実装してみよう
# 
# 自分のアイデアを活かしたプログラムを自由に作成せよ
# 
# プログラムの説明（どういうプログラムなのか）と実装コード、および出力結果を記載すること
# 
# 工夫した点などが記載されていると尚良い
# 
# アイデア例として、
# 
# - 特殊な性質を持つ整数を出力するプログラム： 「友愛数」・「カプレカ数」など
# 
# - 数学的に有名な数列を出力するプログラム： 「パスカルの三角形」など
# 
# - 日常的に使えそうなプログラム: 「日付を入力すると曜日を算出する」

# In[ ]:


# 以下よりコードを記入してください  ##############################

